# Testing sample networks

2020-09-03

#### Load network 1

In [1]:
import sys
sys.path.append('..')

In [2]:
from traffic_flow.sample_networks import load_network_1

In [3]:
load_network_1.__doc__

'Load a small directed network of 4 zones and 8 directed links'

In [4]:
df_nodes, df_link_types, df_links = load_network_1()

In [5]:
df_nodes.head(3)

   id  is_zone name      coords       pop
0   1     True   BA  (0.0, 0.0)  460000.0
1   2     True   TT  (0.0, 0.0)   65000.0
2   3     True   NR  (0.0, 0.0)   85000.0

In [6]:
df_links.head(3)

   id  node_from  node_to  type   name  length    count
0   1          5        6     1  BA-TT      36  26000.0
1   1          6        5     1  BA-TT      36  26000.0
2   2          6        7     2  TT-NR      36  21000.0

In [7]:
df_link_types.head(3)

   type type_name   qmax   v0     a  b
0     1       D_6  70000  110  0.15  4
1     2       D_4  50000  125  0.15  4
2     3     intra  40000   50  0.15  4

#### Load network 2

In [9]:
from traffic_flow.sample_networks import load_network_2
df_nodes, df_lt, df_links = load_network_2()

In [10]:
df_links.head(3)

   id  node_from  node_to  type  length      name    count
0   1          1        2     1  36.000  BA-TT D1  22543.0
1   1          2        1     1  36.000  BA-TT D1  22543.0
2   2          2        3     2  36.006  TT-NR R1  12568.0

#### Load network 2 directed

In [12]:
from traffic_flow.sample_networks import load_network_2
df_nodes, df_lt, df_links = load_network_2()

In [13]:
df_nodes.tail(3)

,id,is_zone,code,name,coords,pop,n_employed,n_workplaces,n_students_uni,n_students_standard
31,39,True,KE,KE,"(0,0)",211243.0,88023.0,127412.0,4657.0,28211.0
32,40,True,ZV,ZV,"(0,0)",61542.0,27599.0,27293.0,1648.0,8859.0
33,41,True,BB,BB,"(0,0)",85785.0,40193.0,48863.0,2119.0,11910.0

In [14]:
df_links.head(4)

   id  node_from  node_to  type  length      name    count
0   1          1        2     1  36.000  BA-TT D1  22543.0
1   1          2        1     1  36.000  BA-TT D1  22543.0
2   2          2        3     2  36.006  TT-NR R1  12568.0
3   2          3        2     2  36.006  TT-NR R1  12568.0